/**********************************************************************
//
//
//        ##########                          ######  #########   # ######    #
//      #############                      ########### ######### #########  ###
//     ######## # ###  ##                 ############# ##    ## #####  # ####
//     ####  ##    ## ###                 ###     ### # #      #####   #####
//          #     ###  #            #     ##       ##  ##      ##     ###
//         ## ###### ##      ##  ####    ####          #       #     ##
//       #########  ###  ## ### #######   ######      ##      ##    ###
//      ######      ##  ######  ##  ##       ####     #      ##     ####
//     #######     ##   ###### ##  ###          ##   ##     ###    ######
//     #########   ##  ###### ## ######         ### ##    ###      #  #####
//    ##    ###### ####### ### #### ##  ## #######  ########      ##    ####
//    ##      #### ###  #  ### ### ##  ##########   ######       ##      ####
//   ##         ##                ##   #########    ####         #         ##
//               #              ###
//                              ##
//                             ###
//                             ##
//
//
//							临风程序界面类库 ringdows.lib
//作者：临风
//
//版本：1.0
//
//声明：本类库可以自由使用而不须对作者作出任何回报，但作者希望能得到
//		  你的鼓励和支持。你可以对类库源码作出修改和改进，但希望你能在
//		  修改的同时给作者一份同样的副本。
//		  本类库不得用于任何商业用途，如确实需要，请与作者联系。
//
//e-mail:ringphone@sina.com
//
//原文件名：ringimagelist.cpp
//
//本文件说明：ImageList类实现。
//
**********************************************************************/
#define MAKE_SELF_LIB
#include "ringdows.h"


HIMAGELIST RingImageList::Create(int cx,int cy,UINT flags,int cInitial,int cGrow)
{
	if(m_handle == NULL)
		m_handle = ImageList_Create(cx,cy,flags,cInitial,cGrow);
	return m_handle;
}

BOOL RingImageList::Destroy()
{
	if(m_handle)
	{
		if(ImageList_Destroy(m_handle))
		{
			m_handle = NULL;
			return TRUE;
		}
		else
			return FALSE;
	}
	else
		return TRUE;
}
