/**********************************************************************
//
//
//        ##########                          ######  #########   # ######    #
//      #############                      ########### ######### #########  ###
//     ######## # ###  ##                 ############# ##    ## #####  # ####
//     ####  ##    ## ###                 ###     ### # #      #####   #####
//          #     ###  #            #     ##       ##  ##      ##     ###
//         ## ###### ##      ##  ####    ####          #       #     ##
//       #########  ###  ## ### #######   ######      ##      ##    ###
//      ######      ##  ######  ##  ##       ####     #      ##     ####
//     #######     ##   ###### ##  ###          ##   ##     ###    ######
//     #########   ##  ###### ## ######         ### ##    ###      #  #####
//    ##    ###### ####### ### #### ##  ## #######  ########      ##    ####
//    ##      #### ###  #  ### ### ##  ##########   ######       ##      ####
//   ##         ##                ##   #########    ####         #         ##
//               #              ###
//                              ##
//                             ###
//                             ##
//
//
//							RingSDK VC6界面模仿演示程序
//作者：临风
//
//版本：1.0
//
//说明：本程序演示使用RingSDK界面库模仿VC6界面。
//
//e-mail:ringphone@sina.com
//
//本文件说明：VC6下方的输出栏实现，因为该输出栏不具通用性，
//				  因此未包含在RingSDK界面库中
//
**********************************************************************/
#ifndef _INC_RINGTAB_EX
#define _INC_RINGTAB_EX
#include "ringdows.h"

class RingTabEx:public RingTab
{
public:
	RingTabEx()
	{
		m_pen = CreatePen(PS_SOLID,1,0x0);
		m_penGray = CreatePen(PS_SOLID,1,0x00848284);
	}
	virtual ~RingTabEx(){DeleteObject(m_pen);DeleteObject(m_penGray);}

protected:
	LRESULT RingdowProc(HWND,RINGPARAMS);
	LRESULT OnPaint(RINGPARAMS&);
private:
	HPEN m_pen,m_penGray;
};

#endif